#include <conio.h>
#include <stdio.h>
#include <locale.h>
int main () 
{
    setlocale(LC_ALL,"Rus");
// объявление массива и его инициализация
int arr[10] = {101, 102, 103, 104, 105, 106, 107, 108, 109, 110};
int *p, *q; // указатели на тип int
int i;
printf("Массив: ");
for (i = 0; i < 10; i++)
printf(" [%d]=%d|", i, arr[i]);
printf("\n\n");
// 1 ----------------------------------------------------------------------
p = &arr[0];
printf("Адрес 1-го элемента массива (p): %p\n", p);
printf("Значение 1-го элемента массива (*p): %d\n", *p);
q = p + 1;
printf("Адрес 2-го элемента массива (q): %p\n", q);
printf("Значение 2-го элемента массива (*q): %d\n", *q);
q = q + 2;
printf("Адрес 4-го элемента массива (q): %p\n", q);
printf("Значение 4-го элемента массива (*q): %d\n", *q);
printf("\n");
// 2 ---------------------------------------------------------------------
// имя массива является указателем на его первый элемент
printf("Адрес 1-го элемента массива (arr): %p\n", arr);

printf("Значение 1-го элемента массива (*arr): %d\n", *arr);
// Поэтому …
p = arr + 2; // то же самое, что p = &arr[0] + 2
printf("Адрес 3-го элемента массива (arr + 2): %p\n", p);
printf("Значение 3-го элемента массива (*(arr+2)): %d\n", *p);
printf("Адрес 6-го элемента массива (p + 3): %p\n", p+3);
printf("Значение 6-го элемента массива (*(p+3)): %d\n", *(p+3));
printf("\n");
// 3 --------------------------------------------------------------------
// указатель можно употреблять в выражениях с индексом
p = arr;
printf("Значение 10-го элемента массива (p[9]): %d\n", p[9]);
printf("\n");
// 4 --------------------------------------------------------------------
p = arr; // arr++ использовать нельзя, a p++ можно
for (i = 0; i < 10; i++, p++)
printf("%2d-й: %p %d\n", i+1, p, *p);
getch();
}
